{"ART": "Adaptive Resonance Theory (ART) is a cognitive and neural theory developed by Stephen Grossberg in 1976 that explains how our brains learn to attend, recognize, and predict objects and events in a changing world. It is based on the concept of adaptive resonance, which is a consensus between what is out there in the world and what we expect to see based on our past experiences. ART is used in two forms: as algorithms for large-scale engineering and technological applications, and as a biological theory. It has been used in many applications, including engineering design retrieval systems, classification and prediction of sonar and radar signals, and control of mobile robots.", "shroud": "A shroud is a piece of cloth or other material used to cover or wrap a person's body for burial.", "anticipatory": "Anticipatory error gradient is a term used to describe the errors made when recalling items from a list, where errors are more likely for items closer to the beginning of the list than those further away.", "Hebbian": "Hebbian learning is a type of learning in which an increase in the strength of a connection between two neurons is associated with an increase in the activity of both neurons. It is based on the idea that neurons that fire together, wire together, and is named after the Canadian psychologist Donald Hebb.", "associative": "Associative is a type of learning in which an association is made between two stimuli, such that the presence of one stimulus leads to the anticipation of the other. It is a form of classical conditioning in which a previously neutral stimulus becomes associated with a response.", "attentive": "Attentive means paying close attention to something or someone. It is the act of focusing one's mental or physical energy on a particular task or activity.", "babbling": "Babbling is a phase of development in which babies spontaneously generate sounds and movements to explore their environment. It is during this phase that babies learn a map between their motor commands and the corresponding auditory and visual representations.", "complementary": "Complementary Computing is a form of computation in which multiple processing streams interact together to overcome the complementary weaknesses of individual processing stages. It is a revolutionary paradigm for explaining how brains give rise to minds.", "bistable": "Bistable is a phenomenon in which a single stimulus can be perceived in two different ways, and the perception can switch spontaneously between the two interpretations.", "filling-in": "Filling-in is a perceptual process in which incomplete or missing visual information is completed or filled in by the brain. It is a process that occurs when the brain takes incomplete visual information and uses what it already knows to fill in the gaps.", "cARTWORD": "cARTWORD is a laminar cortical model of speech perception, learning, and recognition that uses variations of the same canonical laminar circuitry to explain and predict data about speech perception. The model is based on the Adaptive Resonance Theory (ART) and uses two- way interactions between bottom- up and top- down processing to explain how conscious speech perception occurs.", "polyvalent": "Polyvalent is an adjective meaning having multiple uses or functions.", "outstar": "Outstar learning is a type of learning algorithm used to learn top-down expectations in artificial neural networks. It involves a single category node sending multiple diverging pathways to a network of feature nodes. The adaptive weights in the outstar pathways learn the average pattern of activity across the feature level nodes throughout the time interval when the sampling signal fxii() is positive. Outstar learning is often used in combination with instar learning to learn the adaptive weights in bottom-up filters and top-down expectations in an ART network.", "consciousness": "Consciousness is the state of being aware of one's environment and one's own thoughts, feelings, and sensations. It is the ability to experience and process information from the external world and the internal world of the mind.", "qualia": "Qualia is the subjective experience of sensory phenomena, such as the feeling of pain or the taste of a strawberry, that cannot be explained in terms of physical properties. It is a term used in philosophy to describe the subjective, conscious experience of an individual.", "vision": "Vision is the ability to perceive or detect visual information using the eyes. It involves the ability to process and interpret visual information, and to recognize patterns and objects in the environment.", "paradigm": "A paradigm is a set of assumptions, concepts, values, and practices that constitutes a way of viewing reality for the community that shares them, especially in an intellectual discipline.", "amodal": "Amodal perception is the ability to recognize an object or boundary without any corresponding visible surface qualia. It is a type of perception that is based on the interaction of boundaries and surfaces, rather than on visible signs of brightness, color, or other qualia.", "contrast-invariant": "Contrast-invariant boundary perception is a phenomenon in which the boundaries of an object remain recognizable despite changes in contrast or illumination.", "conscious speech": "Conscious speech is the process of perceiving and understanding spoken language, which involves the integration of auditory and cognitive processes. It is the result of the brain's ability to interpret and comprehend the sounds of speech, as well as the context of the words being spoken.", "conscious resonance": "Conscious resonance is an \"extra degree of freedom\" that is triggered at processing stages that compute sufficiently complete, context-sensitive, and stable perceptual or affective representations with which to control successful behaviors.", "degree of freedom": "Degree of freedom is the number of independent variables or choices that are available to a system or individual. It is a measure of the system's or individual's ability to make decisions and take action without being constrained by external factors.", "abstract prototype": "Abstract prototype is a type of prototype that is characterized by its general and abstract nature, rather than by its concrete and specific details. It is used to represent a class or category of objects, rather than a single instance. Abstract prototypes are often used in artificial intelligence and machine learning applications to recognize patterns and classify objects.", "ABC Theorem": "The ABC Theorem is a mathematical theorem developed by Morris (or Moe) Hirsch which states that a recurrent on-center off-surround network can be defined by three terms: A, B, and C. Term C is the adaptation level, whereas terms A and B may differ for every population in the network. The theorem can be used to explain how similar mathematical properties can be used to derive surprising conclusions about other disciplines, such as economics and politics.", "Adaptation Level System": "Adaptation Level Systems (ALS) are classes of cooperative-competitive systems that have a state-dependent adaptation level which is experienced by every population in the network. The adaptation level acts as a constraint on the behavior of the individuals in the system, allowing for the emergence of a collectively useful property from interactions that permit a considerable amount of local freedom of choice.", "active vision": "Active vision is a field of computer vision that studies how humans and other animals learn to recognize objects in a 2D image or 3D scene while scanning the scene with eye movements. It involves the analysis of how interacting combinations of retinotopic and head-centered, or spatial, representations work together in the neocortex.", "Golden Mean": "The Golden Mean is a concept in philosophy and psychology that suggests that the ideal state of balance lies between two extremes. It is often used to describe the optimal level of arousal in a person, where too little or too much can lead to depression or other mental disorders. It is also used to suggest that moderation in all things is the best approach to life.", "vigilance disease": "Vigilance disease is a term used to describe neurological disorders that involve disturbances in the regulation of attention and alertness. Symptoms of vigilance disease can include sleep disturbances, memory problems, and difficulty with novel experiences. Examples of vigilance diseases include Alzheimer's disease, autism, and schizophrenia.", "minimax learning via match tracking": "Minimax learning via match tracking is a learning algorithm that uses a minimax approach to track and match patterns in data. It is used to optimize the accuracy of predictions by minimizing the maximum errors of the predictions.", "spatial category learning system": "A spatial category learning system is a type of artificial neural network that is used to learn and recognize spatial patterns and categories. It is based on the Adaptive Resonance Theory (ART) and uses a self-stabilizing mechanism to ensure the stability of the learned patterns. It is used in various forms throughout the brain to learn and recognize spatial patterns and categories, such as grid cells and place cells.", "anomalous brightness differentiation": "Anomalous brightness differentiation is an optical phenomenon in which two sectors of an annulus region of uniformly higher luminance appear to have different levels of brightness, even though they have the same area.", "watercolor illusion": "Watercolor illusion is an optical illusion in which colors appear to spread across boundaries, creating a watercolor-like effect. This effect is caused by the assimilation of colors due to visible contours, and is explained by the spatial competition between like-oriented boundary signals.", "complementary motion streams": "Complementary motion streams refer to the phenomenon in which two or more motion streams, such as those of objects in a scene, are perceived as a single motion stream.", "BCS": "BCS stands for Boundary Contour System. It is a model of visual perception that explains how boundaries are generated at contrasts, or contours, in a scene. It is composed of two mutually complementary and interacting processing streams, the Boundary Contour System (BCS) and the Feature Contour System (FCS). The BCS is responsible for generating boundaries at contrasts in a scene, while the FCS is responsible for constructing visible surface properties such as color, brightness, and depth.", "FCS": "Feature Contour System (FCS) is a surface model proposed in traditional computer vision algorithms that combines visible surface properties such as form, color, and depth. It is used to construct representations of visible features in a scene, such as color contours, feature patterns, and brightness constancy.", "perceptual grouping": "Perceptual grouping is the process by which the brain organizes visual information into meaningful patterns and shapes. It involves the integration of various features of a visual stimulus, such as color, shape, size, and orientation, to form a unified representation of the stimulus. This process is thought to be largely driven by bottom-up processes, such as filtering and perceptual grouping, that act directly on visual scenes and images at early stages of brain processing.", "attentionally blocked": "Attentional blocking is a phenomenon in which a stimulus that is predictively irrelevant is not noticed or processed by the brain. It is similar to the way in which wallpaper in a dining room is not noticed or processed. Attentional blocking can be reversed through unblocking, which occurs when the stimulus becomes predictively relevant.", "broken symmetry": "Broken symmetry is a phenomenon in which a system is not symmetrical or balanced, resulting in an imbalance between two or more components. This imbalance can manifest itself in various ways, such as in the form of handedness, cerebral dominance, or the favoring of one type of process over another. Broken symmetry can also be used to describe the unequal distribution of inputs and outputs in a network, or the favoring of one type of noise suppression over another.", "cognitive-emotional": "Cognitive-emotional resonance is a process in which cognitive and emotional states interact to produce a unified response. It involves the integration of cognitive processes such as attention, memory, and decision-making with emotional processes such as motivation and reward. This integration is thought to be the basis of complex behavior and decision-making.", "conditioned inhibitor": "Conditioned inhibitor is a type of learning that occurs when a conditioned stimulus (CS) is paired with a reward or other positive reinforcement, but is not followed by a punishment or other negative reinforcement. The conditioned inhibitor does not extinguish, or weaken, when the CS is presented without the reward or punishment, unlike conditioned excitators which do extinguish. This type of learning is often used to explain why certain emotional memories persist for a long time, while others are more easily forgotten.", "gated steepest descent": "Gated steepest descent learning is a learning law that explains how long-term memory traces track and approach the value of a post-synaptic short-term memory signal through time. Learning only occurs when a pre-synaptic short-term “sampling” signal is active enough, and thereby opens a learning “gate” that enables steepest descent to occur.", "expectation": "Expectation is the anticipation of a future event or outcome based on past experience or knowledge. In the context of neuroscience, expectation is the concept of resonance in neural systems, where external input matches already stored knowledge (expectation and attention) to create a dynamical structure that suppresses noise and irrelevant details and enables fast and effective responses. When resonance fails, this triggers adaptation.", "feedforward": "Feedforward is a type of network in which information flows in one direction, from the outside of the system progressively inward. It is distinct from a feedback network, in which interactions occur in both directions, both to and from a given neuron. Feedforward networks are used in computing, neuroscience, and other fields to process and analyze data.", "GRIDSmap": "GRIDSmap is a model developed by Himanshu and Anatoli which uses algorithmically defined stripe cells to process realistic rat trajectories. The stripe cell outputs then form inputs to the adaptive filter of a self-organizing map which learns hexagonal grid cell receptive fields. This model is used to explain how grid cells and place cells are learned through movement trajectories.", "habituated": "Habituated is a term used to describe a decrease in the sensitivity of a neuron or neural circuit to a stimulus, due to repeated exposure to the same stimulus. This form of activity-dependent desensitization is called transmitter habituation, or synaptic depression. It is a form of learning in which the response to a stimulus is reduced over time, leading to a decrease in the overall response of the neuron or neural circuit.", "LIST PARSE model": "The LIST PARSE model is a laminar cortical model of cognitive information processing that explains and predicts data about working memory and list chunking. It uses variations of the same canonical laminar cortical circuitry as the 3D LAMINART model for vision and the cARTWORD model for speech perception, thereby providing insights into how specialized resonances use similar types of circuits to support different conscious experiences.", "MOTIVATOR": "Motivator is a term used to describe a model of cognitive-emotional interactions that explains how the amygdala, lateral hypothalamus, and orbitofrontal cortex interact to make emotionally-modulated decisions. The model is based on the CogEM model and includes a model of how a key process in the basal ganglia works. The model is used to explain how reinforcement learning can react flexibly to arbitrary combinations of expected and unexpected events, and how it contributes to the incentive value of rewards and their sensitivity to reward devaluation.", "nSTART": "nSTART (neurotrophic Spectrally Timed Adaptive Resonance Theory) is a model developed by Stephen Grossberg and his PhD student Daniel Franklin to explain and simulate the complex experimental literature on memory consolidation. nSTART proposes how adaptively timed learning in the hippocampus, bolstered by Brain Derived Neurotrophic Factor, or BDNF, helps to ensure normal memory consolidation. It includes simulations of the complex pattern of disruptions of memory consolidation that occur in response to early vs. late lesions of thalamus, amygdala, hippocampus, and orbitofrontal cortex.", "aperture problem": "The aperture problem is a phenomenon in which a localized neural motion sensor, such as a neuron in the early visual pathway, is unable to accurately measure the direction and speed of motion when a contour within an aperture does not contain unambiguous features. This is because the receptive field of the motion sensor is limited in size, and thus can only detect motion in one direction.", "apparent motion": "Apparent motion is a visual illusion in which a series of static images appear to be moving. It is created by the brain's ability to interpolate between intermittent views of a moving object, and is used to track and predict the object's position through time. In this context, it is often used to track a predator or prey animal through time when it moves at variable speeds behind intermittent occluders, such as bushes and trees.", "barberpole illusion": "The barberpole illusion is an optical illusion in which a rotating barberpole appears to move in a single direction, even though its local motion signals suggest multiple directions. This illusion is used to explain how the visual system can integrate spatially separated motion signals into a single object motion percept. It is also used to explain how the brain can track an object's direction and speed of motion, even under challenging lighting conditions.", "chopsticks illusion": "The chopsticks illusion is an unambiguous percept of objects moving in depth, where two overlapping diagonal bars of the same luminance (the “chopsticks”) move in opposite directions, to the left or to the right. The display contains two kinds of features: the terminators of each line and the intersection of the two lines. When the lines are viewed behind visible occluders, they appear to move together as a welded unit in the upward direction. When the occluders are made invisible, the lines no longer cohere and appear to slide one on top of the other in opposite directions. The chopsticks illusion not only depends upon how feature tracking signals are altered by visible and invisible occluders, but also upon how the form system disambiguates the ambiguous region where the two chopsticks intersect and uses figure-ground mechanisms to separate them in depth.", "direction-of-motion": "Direction-of-motion refers to the direction in which an object is moving, as perceived by an observer. \n\nIn this book, the term is used to describe the estimation of motion direction and speed, as well as the capture of direction and speed of motion, and the separation of form and motion streams.", "noise-saturation dilemma": "The noise-saturation dilemma is a thought experiment used to explore the balance between cooperation and competition in pattern processing and the effects of brightness constancy and contrast. It involves a shunting on-center off-surround network and a global off-surround to suppress noise.\n\nThe usage of the term in this book does not diverge from its conventional meaning.", "memory consolidation": "Memory consolidation is the process by which memories are stored and strengthened in the brain over time. It involves the reorganization of neural pathways and the strengthening of synaptic connections between neurons. It is believed to be an important factor in the formation of long-term memories. In the context of this book, memory consolidation is an emergent property of interactions between the attentional and orienting systems during memory searches. It occurs when events become familiar and the orienting system is automatically disengaged, allowing for the formation of long-term memories.", "Masking Field": "Masking Field is a type of Item-Order-Rank working memory that is capable of storing sequences of item chunks, including sequences with repeated chunks, and can selectively respond to sequences of variable lengths. It is composed of a recurrent on-center off-surround network whose cells obey the membrane equations of neurophysiology, or shunting laws. Masking Fields are activated by a bottom-up adaptive filter and generate top-down expectation signals that focus attention at the preceding level upon compatible combinations of item or list chunks.", "match learning": "Match learning is a form of learning in which a model or system is trained to recognize and respond to a particular pattern or prototype. This type of learning is used to solve the stability-plasticity dilemma, which is the challenge of balancing the need for a system to remain stable while also allowing it to adapt to new information. Match learning is used in the brain to learn categories and to calibrate signals in order to generate accurate movements. It is a form of mismatch learning in which a difference vector is used as an error signal to adjust the weights of the system until the difference vector is zero.", "match tracking": "Match tracking is a patented process used in artificial neural networks to achieve minimax learning, whereby the minimum amount of memory is used to adequately predict the outcome in any given situation. Match tracking works by increasing the vigilance parameter just enough to trigger a memory search for a better-matching category in response to a predictive error. This allows the network to learn the most general recognition categories while conserving memory resources.", "Motor Theory of Speech Perception": "The Motor Theory of Speech Perception is a theory which proposes that people perceive spoken words by recognizing the motor commands that produce them, rather than by recognizing the sound patterns they generate. This theory suggests that the auditory and motor systems interact and shape each other in the process of speech perception. In this book, the Motor Theory of Speech Perception is used to explain how auditory feature patterns, auditory categories, and motor commands interact to enable speech perception.", "moving reference frame": "A moving reference frame is a reference frame that is in motion relative to an observer. In the context of this book, a moving reference frame is used to describe the phenomenon of vector decomposition, whereby the global motion of an object is subtracted from the true motion path of localized stimulus components, so that objects and their parts are seen as moving relative to a common reference frame.", "object contextual cueing": "Object contextual cueing is a cognitive phenomenon in which prior knowledge about the spatial and object contexts of a scene helps to facilitate and speed up visual search. It is typically measured by subtracting reaction time (RT) for searching a familiar scene from the RT for searching a novel scene. Object contextual cueing is typically studied using psychological experiments, and has inspired the development of many visual search models.", "opponent extinction": "Opponent extinction is a process in which counter-conditioning an OFF channel using antagonistic rebounds can use opponent competition and back-propagating dendritic spikes to force forgetting of ON channel contingencies that are no longer relevant. This process is used to prevent LTM saturation and to normalize net activities in which the smaller activity is inhibited to zero and the larger activity is sensitive to the ratio of the inputs. It is also used to inhibit motivation for action and expectations of any no-shock place to which to escape, as seen in learned helplessness.", "opponent processes": "Opponent processes are brain circuits wherein positive and negative emotional centers interact together, activating mutually exclusive pathways that compete with one another. Opponent processes are designed to enable antagonistic rebounds to occur, allowing for adaptive responses to changing environments.", "overshadowing": "Overshadowing is a phenomenon in classical conditioning where prior learning of one stimulus (CS1) prevents learning of another stimulus (CS2) even when the two stimuli are presented simultaneously. It is an extreme version of blocking, where CS1 is presented before a US until it becomes a conditioned reinforcer.", "Pasupathy": "Pasupathy is the surname of Anitha Pasupathy, a scientist who, along with Earl Miller, published a paper in 2004 that showed there are different time courses of learning-related activity in the prefrontal cortex and basal ganglia that are consistent with the TELOS model prediction of how basal ganglia-mediated gating of prefrontal cortical plans is learned.", "PHONET": "PHONET is a neural theory of speech and language learning, perception, recognition, and recall that is based on Adaptive Resonance Theory (ART) models. It explains how the brain can rapidly learn speech and language without risking catastrophic forgetting. PHONET models include ARTPHONE, ARTWORD, and conscious ARTWORD (cARTWORD). They interact with the stream- shroud circuits that determine conscious hearing, and the spectral- pitch- and- timbre resonances that recognize the auditory objects that occur in these streams.", "pixel-to-pixel": "Pixel-to-pixel mapping is a process of mapping the pixels of an image to the pixels of another image. This is typically done to compare the two images and identify any differences between them.\n\nIn the given context, the term is used to describe a process used to map the neurons of the brain to the pixels of an image. This is done to compare the neurons and the pixels and identify any differences between them.", "PART": "PART (noun): A distinct section or division of a larger whole; a component.", "reaction-diffusion": "Reaction-diffusion is a mathematical model used to describe the spread of chemical reactions in a system over time and space. It is commonly used to explain the development of biological systems, such as the growth of cells and patterns in nature. In this book, reaction-diffusion is used to explain the development of feature detectors in the visual cortex, the development of competitive learning and self-organizing maps, and the development of adaptive resonance theory.", "self-punitive": "Self-punitive behaviors are those in which an individual engages in activities that cause harm to themselves, either physically or psychologically. In the book, self-punitive behaviors are discussed in the context of self-organizing memories, and the idea that memories can be self-stabilizing and self-punitive. This suggests that memories can be used to punish oneself, either consciously or unconsciously, in order to regulate behavior.", "macrocircuit": "Macrocircuit is a term used to refer to a large-scale network of interconnected components that are responsible for a particular cognitive process. It is typically used to describe the architecture of the brain, and how different parts of the brain interact to produce a particular behavior or thought process. Macrocircuits are often used to explain how different cognitive processes work, and how they interact with each other.", "NormNet": "NormNet is a neural network model developed by Heather Ames and Stephen Grossberg in 2008 to explain how speaker normalization is accomplished in the brain. It proposes that speaker normalization is accomplished by specializing streaming mechanisms at the next processing stage, and is based on the use of strip maps and spatially asymmetric competitive maps.", "synchronization problem": "Synchronization problem is a type of problem that involves establishing and maintaining a consistent and coordinated relationship between multiple components or systems.\n\nIn the context of the book, the synchronization problem is specifically related to the synchronous oscillation of neurons in the cortex, and the ability to establish and maintain a consistent and coordinated relationship between different layers of the cortex.", "mismatch in attentional system": "Mismatch in attentional system is a phenomenon in which the attentional and orienting systems of the brain fail to process expected and unexpected events in parallel, leading to an error in the cognitive-emotional interactions. This mismatch can be corrected by activating a nonspecific arousal response, which serves as an error-correcting event.", "timing paradox": "Timing paradox is a phenomenon in which inhibition of orienting responses is spread throughout a time interval, while adaptively timed responses are triggered at the end of the interval. This phenomenon is solved by the Weber law, which creates an adaptively timed response throughout the time interval that peaks at the end of the interval.", "Theory of Mind": "Theory of Mind is a cognitive capacity that enables an individual to understand the mental states of other people, such as their beliefs, desires, and intentions. It is a key component of social cognition and is essential for successful social interaction. In the book, Theory of Mind is used to explain the breakdowns in mental disorders such as autism and schizophrenia, which are characterized by deficits in social functioning. The book suggests that these deficits are caused by hypoactivity of the amygdala or orbitofrontal cortex, which prevents cognitive-emotional resonance from occurring and leads to failures in Theory of Mind processes."}