{"ART": "Adaptive Resonance Theory (ART) is a cognitive and neural theory developed by Stephen Grossberg in 1976 that explains how our brains learn to attend, recognize, and predict objects and events in a changing world. It is based on the concept of adaptive resonance, which is a consensus between what is out there in the world and what we expect to see based on our past experiences. ART is used in two forms: as algorithms for large-scale engineering and technological applications, and as a biological theory. It has been used in many applications, including engineering design retrieval systems, classification and prediction of sonar and radar signals, and control of mobile robots.", "shroud": "A shroud is a type of resonance that is predicted to support conscious percepts, recognition, and feelings. It is a dynamical state that “lights up” to enable a conscious experience to occur, and is not just a “whir of information processing”. There are six main kinds of resonances which support different kinds of conscious awareness: surface-shroud, feature-category, stream-shroud, spectral-pitch-and-timbre, item-list, and cognitive-emotional.", "anticipatory": "Anticipatory error gradient is a term used to describe the errors made when recalling items from a list, where errors are more likely for items closer to the beginning of the list than those further away.", "Hebbian": "Hebbian learning is a type of learning in which an increase in the strength of a connection between two neurons is associated with an increase in the activity of both neurons. It is based on the idea that neurons that fire together, wire together, and is named after the Canadian psychologist Donald Hebb.", "associative": "Associative is a type of learning in which an association is made between two stimuli, such that the presence of one stimulus leads to the anticipation of the other. It is a form of classical conditioning in which a previously neutral stimulus becomes associated with a response.", "attentive": "Attentive means paying close attention to something or someone. It is the act of focusing one's mental or physical energy on a particular task or activity.", "babbling": "Babbling is a phase of development in which babies spontaneously generate sounds and movements to explore their environment. It is during this phase that babies learn a map between their motor commands and the corresponding auditory and visual representations.", "complementary": "Complementary Computing is a form of computation in which multiple processing streams interact together to overcome the complementary weaknesses of individual processing stages. It is a revolutionary paradigm for explaining how brains give rise to minds.", "bistable": "Bistable is a phenomenon in which a single stimulus can be perceived in two different ways, and the perception can switch spontaneously between the two interpretations.", "filling-in": "Filling-in is a perceptual process in which incomplete or missing visual information is completed or filled in by the brain. It is a process that occurs when the brain takes incomplete visual information and uses what it already knows to fill in the gaps.", "cARTWORD": "cARTWORD is a laminar cortical model of speech perception, learning, and recognition that uses variations of the same canonical laminar circuitry to explain and predict data about speech perception. The model is based on the Adaptive Resonance Theory (ART) and uses two- way interactions between bottom- up and top- down processing to explain how conscious speech perception occurs.", "polyvalent": "Polyvalent is an adjective meaning having multiple uses or functions.", "outstar": "Outstar learning is a type of learning algorithm used to learn top-down expectations in artificial neural networks. It involves a single category node sending multiple diverging pathways to a network of feature nodes. The adaptive weights in the outstar pathways learn the average pattern of activity across the feature level nodes throughout the time interval when the sampling signal fxii() is positive. Outstar learning is often used in combination with instar learning to learn the adaptive weights in bottom-up filters and top-down expectations in an ART network.", "consciousness": "Consciousness is the state of being aware of one's environment and one's own thoughts, feelings, and sensations. It is the ability to experience and process information from the external world and the internal world of the mind.", "qualia": "Qualia is a term used to refer to the subjective, conscious experience of sensory phenomena. It is often used to refer to the subjective experience of sensory qualities such as color, sound, taste, and smell. Qualia is distinct from the objective, physical properties of the sensory stimuli, and is considered to be an essential part of conscious experience. In this book, qualia is used to refer to the conscious experience of visual and auditory phenomena, as well as the recognition of objects and scenes.", "vision": "Vision is the ability to perceive or detect visual information using the eyes. It involves the ability to process and interpret visual information, and to recognize patterns and objects in the environment.", "paradigm": "A paradigm is a set of assumptions, concepts, values, and practices that constitutes a way of viewing reality for the community that shares them, especially in an intellectual discipline.", "amodal": "Amodal perception is the ability to recognize an object or boundary without any corresponding visible surface qualia. It is a type of perception that is based on the interaction of boundaries and surfaces, rather than on visible signs of brightness, color, or other qualia.", "contrast-invariant": "Contrast-invariant boundary perception is a phenomenon in which the boundaries of an object remain recognizable despite changes in contrast or illumination.", "conscious speech": "Conscious speech is the process of perceiving and understanding spoken language, which involves the integration of auditory and cognitive processes. It is the result of the brain's ability to interpret and comprehend the sounds of speech, as well as the context of the words being spoken.", "conscious resonance": "Conscious resonance is an \"extra degree of freedom\" that is triggered at processing stages that compute sufficiently complete, context-sensitive, and stable perceptual or affective representations with which to control successful behaviors.", "degree of freedom": "Degree of freedom is the number of independent variables or choices that are available to a system or individual. It is a measure of the system's or individual's ability to make decisions and take action without being constrained by external factors.", "abstract prototype": "Abstract prototype is a type of prototype that is characterized by its general and abstract nature, rather than by its concrete and specific details. It is used to represent a class or category of objects, rather than a single instance. Abstract prototypes are often used in artificial intelligence and machine learning applications to recognize patterns and classify objects.", "ABC Theorem": "The ABC Theorem is a mathematical theorem developed by Morris (or Moe) Hirsch which states that a recurrent on-center off-surround network can be defined by three terms: A, B, and C. Term C is the adaptation level, whereas terms A and B may differ for every population in the network. The theorem can be used to explain how similar mathematical properties can be used to derive surprising conclusions about other disciplines, such as economics and politics.", "Adaptation Level System": "Adaptation Level Systems (ALS) are classes of cooperative-competitive systems that have a state-dependent adaptation level which is experienced by every population in the network. The adaptation level acts as a constraint on the behavior of the individuals in the system, allowing for the emergence of a collectively useful property from interactions that permit a considerable amount of local freedom of choice.", "active vision": "Active vision is a field of computer vision that studies how humans and other animals learn to recognize objects in a 2D image or 3D scene while scanning the scene with eye movements. It involves the analysis of how interacting combinations of retinotopic and head-centered, or spatial, representations work together in the neocortex.", "Golden Mean": "The Golden Mean is a concept in philosophy and psychology that suggests that the ideal state of balance lies between two extremes. It is often used to describe the optimal level of arousal in a person, where too little or too much can lead to depression or other mental disorders. It is also used to suggest that moderation in all things is the best approach to life.", "vigilance disease": "Vigilance disease is a term used to describe neurological disorders that involve disturbances in the regulation of attention and alertness. Symptoms of vigilance disease can include sleep disturbances, memory problems, and difficulty with novel experiences. Examples of vigilance diseases include Alzheimer's disease, autism, and schizophrenia.", "minimax learning via match tracking": "Minimax learning via match tracking is a learning algorithm that uses a minimax approach to track and match patterns in data. It is used to optimize the accuracy of predictions by minimizing the maximum errors of the predictions.", "spatial category learning system": "A spatial category learning system is a type of artificial neural network that is used to learn and recognize spatial patterns and categories. It is based on the Adaptive Resonance Theory (ART) and uses a self-stabilizing mechanism to ensure the stability of the learned patterns. It is used in various forms throughout the brain to learn and recognize spatial patterns and categories, such as grid cells and place cells.", "anomalous brightness differentiation": "Anomalous brightness differentiation is an optical phenomenon in which two sectors of an annulus region of uniformly higher luminance appear to have different levels of brightness, even though they have the same area.", "watercolor illusion": "Watercolor illusion is an optical illusion in which colors appear to spread across boundaries, creating a watercolor-like effect. This effect is caused by the assimilation of colors due to visible contours, and is explained by the spatial competition between like-oriented boundary signals.", "complementary motion streams": "Complementary motion streams refer to the phenomenon in which two or more motion streams, such as those of objects in a scene, are perceived as a single motion stream.", "BCS": "BCS stands for Boundary Contour System. It is a model of visual perception that explains how boundaries are generated at contrasts, or contours, in a scene. It is composed of two mutually complementary and interacting processing streams, the Boundary Contour System (BCS) and the Feature Contour System (FCS). The BCS is responsible for generating boundaries at contrasts in a scene, while the FCS is responsible for constructing visible surface properties such as color, brightness, and depth.", "FCS": "Feature Contour System (FCS) is a surface model proposed in traditional computer vision algorithms that combines visible surface properties such as form, color, and depth. It is used to construct representations of visible features in a scene, such as color contours, feature patterns, and brightness constancy.", "perceptual grouping": "Perceptual grouping is the process by which the brain organizes visual information into meaningful patterns and shapes. It involves the integration of various features of a visual stimulus, such as color, shape, size, and orientation, to form a unified representation of the stimulus. This process is thought to be largely driven by bottom-up processes, such as filtering and perceptual grouping, that act directly on visual scenes and images at early stages of brain processing.", "attentionally blocked": "Attentional blocking is a phenomenon in which a stimulus that is predictively irrelevant is not noticed or processed by the brain. It is similar to the way in which wallpaper in a dining room is not noticed or processed. Attentional blocking can be reversed through unblocking, which occurs when the stimulus becomes predictively relevant.", "broken symmetry": "Broken symmetry is a phenomenon in which a system is not symmetrical or balanced, resulting in an imbalance between two or more components. This imbalance can manifest itself in various ways, such as in the form of handedness, cerebral dominance, or the favoring of one type of process over another. Broken symmetry can also be used to describe the unequal distribution of inputs and outputs in a network, or the favoring of one type of noise suppression over another.", "cognitive-emotional": "Cognitive-emotional resonance is a process in which cognitive and emotional states interact to produce a unified response. It involves the integration of cognitive processes such as attention, memory, and decision-making with emotional processes such as motivation and reward. This integration is thought to be the basis of complex behavior and decision-making.", "conditioned inhibitor": "Conditioned inhibitor is a type of learning that occurs when a conditioned stimulus (CS) is paired with a reward or other positive reinforcement, but is not followed by a punishment or other negative reinforcement. The conditioned inhibitor does not extinguish, or weaken, when the CS is presented without the reward or punishment, unlike conditioned excitators which do extinguish. This type of learning is often used to explain why certain emotional memories persist for a long time, while others are more easily forgotten.", "gated steepest descent": "Gated steepest descent learning is a learning law that explains how long-term memory traces track and approach the value of a post-synaptic short-term memory signal through time. Learning only occurs when a pre-synaptic short-term “sampling” signal is active enough, and thereby opens a learning “gate” that enables steepest descent to occur.", "expectation": "Expectation is the anticipation of a future event or outcome based on past experience or knowledge. In the context of neuroscience, expectation is the concept of resonance in neural systems, where external input matches already stored knowledge (expectation and attention) to create a dynamical structure that suppresses noise and irrelevant details and enables fast and effective responses. When resonance fails, this triggers adaptation.", "feedforward": "Feedforward is a type of network in which information flows in one direction, from the outside of the system progressively inward. It is distinct from a feedback network, in which interactions occur in both directions, both to and from a given neuron. Feedforward networks are used in computing, neuroscience, and other fields to process and analyze data.", "GRIDSmap": "GRIDSmap is a model developed by Himanshu and Anatoli which uses algorithmically defined stripe cells to process realistic rat trajectories. The stripe cell outputs then form inputs to the adaptive filter of a self-organizing map which learns hexagonal grid cell receptive fields. This model is used to explain how grid cells and place cells are learned through movement trajectories.", "habituated": "Habituated is a term used to describe a decrease in the sensitivity of a neuron or neural circuit to a stimulus, due to repeated exposure to the same stimulus. This form of activity-dependent desensitization is called transmitter habituation, or synaptic depression. It is a form of learning in which the response to a stimulus is reduced over time, leading to a decrease in the overall response of the neuron or neural circuit.", "LIST PARSE model": "The LIST PARSE model is a laminar cortical model of cognitive information processing that explains and predicts data about working memory and list chunking. It uses variations of the same canonical laminar cortical circuitry as the 3D LAMINART model for vision and the cARTWORD model for speech perception, thereby providing insights into how specialized resonances use similar types of circuits to support different conscious experiences.", "MOTIVATOR": "Motivator is a term used to describe a model of cognitive-emotional interactions that explains how the amygdala, lateral hypothalamus, and orbitofrontal cortex interact to make emotionally-modulated decisions. The model is based on the CogEM model and includes a model of how a key process in the basal ganglia works. The model is used to explain how reinforcement learning can react flexibly to arbitrary combinations of expected and unexpected events, and how it contributes to the incentive value of rewards and their sensitivity to reward devaluation.", "nSTART": "nSTART (neurotrophic Spectrally Timed Adaptive Resonance Theory) is a model developed by Stephen Grossberg and his PhD student Daniel Franklin to explain and simulate the complex experimental literature on memory consolidation. nSTART proposes how adaptively timed learning in the hippocampus, bolstered by Brain Derived Neurotrophic Factor, or BDNF, helps to ensure normal memory consolidation. It includes simulations of the complex pattern of disruptions of memory consolidation that occur in response to early vs. late lesions of thalamus, amygdala, hippocampus, and orbitofrontal cortex.", "aperture problem": "The aperture problem is a phenomenon in which a localized neural motion sensor, such as a neuron in the early visual pathway, is unable to accurately measure the direction and speed of motion when a contour within an aperture does not contain unambiguous features. This is because the receptive field of the motion sensor is limited in size, and thus can only detect motion in one direction.", "apparent motion": "Apparent motion is a visual illusion in which a series of static images appear to be moving. It is created by the brain's ability to interpolate between intermittent views of a moving object, and is used to track and predict the object's position through time. In this context, it is often used to track a predator or prey animal through time when it moves at variable speeds behind intermittent occluders, such as bushes and trees.", "barberpole illusion": "The barberpole illusion is an optical illusion in which a rotating barberpole appears to move in a single direction, even though its local motion signals suggest multiple directions. This illusion is used to explain how the visual system can integrate spatially separated motion signals into a single object motion percept. It is also used to explain how the brain can track an object's direction and speed of motion, even under challenging lighting conditions.", "chopsticks illusion": "The chopsticks illusion is an unambiguous percept of objects moving in depth, where two overlapping diagonal bars of the same luminance (the “chopsticks”) move in opposite directions, to the left or to the right. The display contains two kinds of features: the terminators of each line and the intersection of the two lines. When the lines are viewed behind visible occluders, they appear to move together as a welded unit in the upward direction. When the occluders are made invisible, the lines no longer cohere and appear to slide one on top of the other in opposite directions. The chopsticks illusion not only depends upon how feature tracking signals are altered by visible and invisible occluders, but also upon how the form system disambiguates the ambiguous region where the two chopsticks intersect and uses figure-ground mechanisms to separate them in depth.", "direction-of-motion": "Direction-of-motion refers to the direction in which an object is moving, as perceived by an observer. \n\nIn this book, the term is used to describe the estimation of motion direction and speed, as well as the capture of direction and speed of motion, and the separation of form and motion streams.", "noise-saturation dilemma": "The noise-saturation dilemma is a thought experiment used to explore the balance between cooperation and competition in pattern processing and the effects of brightness constancy and contrast. It involves a shunting on-center off-surround network and a global off-surround to suppress noise.\n\nThe usage of the term in this book does not diverge from its conventional meaning.", "memory consolidation": "Memory consolidation is the process by which memories are stored and strengthened in the brain over time. It involves the reorganization of neural pathways and the strengthening of synaptic connections between neurons. It is believed to be an important factor in the formation of long-term memories. In the context of this book, memory consolidation is an emergent property of interactions between the attentional and orienting systems during memory searches. It occurs when events become familiar and the orienting system is automatically disengaged, allowing for the formation of long-term memories.", "Masking Field": "Masking Field is a type of Item-Order-Rank working memory that is capable of storing sequences of item chunks, including sequences with repeated chunks, and can selectively respond to sequences of variable lengths. It is composed of a recurrent on-center off-surround network whose cells obey the membrane equations of neurophysiology, or shunting laws. Masking Fields are activated by a bottom-up adaptive filter and generate top-down expectation signals that focus attention at the preceding level upon compatible combinations of item or list chunks.", "match learning": "Match learning is a form of learning in which a model or system is trained to recognize and respond to a particular pattern or prototype. This type of learning is used to solve the stability-plasticity dilemma, which is the challenge of balancing the need for a system to remain stable while also allowing it to adapt to new information. Match learning is used in the brain to learn categories and to calibrate signals in order to generate accurate movements. It is a form of mismatch learning in which a difference vector is used as an error signal to adjust the weights of the system until the difference vector is zero.", "match tracking": "Match tracking is a patented process used in artificial neural networks to achieve minimax learning, whereby the minimum amount of memory is used to adequately predict the outcome in any given situation. Match tracking works by increasing the vigilance parameter just enough to trigger a memory search for a better-matching category in response to a predictive error. This allows the network to learn the most general recognition categories while conserving memory resources.", "Motor Theory of Speech Perception": "The Motor Theory of Speech Perception is a theory which proposes that people perceive spoken words by recognizing the motor commands that produce them, rather than by recognizing the sound patterns they generate. This theory suggests that the auditory and motor systems interact and shape each other in the process of speech perception. In this book, the Motor Theory of Speech Perception is used to explain how auditory feature patterns, auditory categories, and motor commands interact to enable speech perception.", "moving reference frame": "A moving reference frame is a reference frame that is in motion relative to an observer. In the context of this book, a moving reference frame is used to describe the phenomenon of vector decomposition, whereby the global motion of an object is subtracted from the true motion path of localized stimulus components, so that objects and their parts are seen as moving relative to a common reference frame.", "object contextual cueing": "Object contextual cueing is a cognitive phenomenon in which prior knowledge about the spatial and object contexts of a scene helps to facilitate and speed up visual search. It is typically measured by subtracting reaction time (RT) for searching a familiar scene from the RT for searching a novel scene. Object contextual cueing is typically studied using psychological experiments, and has inspired the development of many visual search models.", "opponent extinction": "Opponent extinction is a process in which counter-conditioning an OFF channel using antagonistic rebounds can use opponent competition and back-propagating dendritic spikes to force forgetting of ON channel contingencies that are no longer relevant. This process is used to prevent LTM saturation and to normalize net activities in which the smaller activity is inhibited to zero and the larger activity is sensitive to the ratio of the inputs. It is also used to inhibit motivation for action and expectations of any no-shock place to which to escape, as seen in learned helplessness.", "opponent processes": "Opponent processes are brain circuits wherein positive and negative emotional centers interact together, activating mutually exclusive pathways that compete with one another. Opponent processes are designed to enable antagonistic rebounds to occur, allowing for adaptive responses to changing environments.", "overshadowing": "Overshadowing is a phenomenon in classical conditioning where prior learning of one stimulus (CS1) prevents learning of another stimulus (CS2) even when the two stimuli are presented simultaneously. It is an extreme version of blocking, where CS1 is presented before a US until it becomes a conditioned reinforcer.", "Pasupathy": "Pasupathy is the surname of Anitha Pasupathy, a scientist who, along with Earl Miller, published a paper in 2004 that showed there are different time courses of learning-related activity in the prefrontal cortex and basal ganglia that are consistent with the TELOS model prediction of how basal ganglia-mediated gating of prefrontal cortical plans is learned.", "PHONET": "PHONET is a neural theory of speech and language learning, perception, recognition, and recall that is based on Adaptive Resonance Theory (ART) models. It explains how the brain can rapidly learn speech and language without risking catastrophic forgetting. PHONET models include ARTPHONE, ARTWORD, and conscious ARTWORD (cARTWORD). They interact with the stream- shroud circuits that determine conscious hearing, and the spectral- pitch- and- timbre resonances that recognize the auditory objects that occur in these streams.", "pixel-to-pixel": "Pixel-to-pixel mapping is a process of mapping the pixels of an image to the pixels of another image. This is typically done to compare the two images and identify any differences between them.\n\nIn the given context, the term is used to describe a process used to map the neurons of the brain to the pixels of an image. This is done to compare the neurons and the pixels and identify any differences between them.", "PART": "PART (noun): A distinct section or division of a larger whole; a component.", "reaction-diffusion": "Reaction-diffusion is a mathematical model used to describe the spread of chemical reactions in a system over time and space. It is commonly used to explain the development of biological systems, such as the growth of cells and patterns in nature. In this book, reaction-diffusion is used to explain the development of feature detectors in the visual cortex, the development of competitive learning and self-organizing maps, and the development of adaptive resonance theory.", "self-punitive": "Self-punitive behaviors are those in which an individual engages in activities that cause harm to themselves, either physically or psychologically. In the book, self-punitive behaviors are discussed in the context of self-organizing memories, and the idea that memories can be self-stabilizing and self-punitive. This suggests that memories can be used to punish oneself, either consciously or unconsciously, in order to regulate behavior.", "macrocircuit": "Macrocircuit is a term used to refer to a large-scale network of interconnected components that are responsible for a particular cognitive process. It is typically used to describe the architecture of the brain, and how different parts of the brain interact to produce a particular behavior or thought process. Macrocircuits are often used to explain how different cognitive processes work, and how they interact with each other.", "NormNet": "NormNet is a neural network model developed by Heather Ames and Stephen Grossberg in 2008 to explain how speaker normalization is accomplished in the brain. It proposes that speaker normalization is accomplished by specializing streaming mechanisms at the next processing stage, and is based on the use of strip maps and spatially asymmetric competitive maps.", "synchronization problem": "Synchronization problem is a type of problem that involves establishing and maintaining a consistent and coordinated relationship between multiple components or systems.\n\nIn the context of the book, the synchronization problem is specifically related to the synchronous oscillation of neurons in the cortex, and the ability to establish and maintain a consistent and coordinated relationship between different layers of the cortex.", "mismatch in attentional system": "Mismatch in attentional system is a phenomenon in which the attentional and orienting systems of the brain fail to process expected and unexpected events in parallel, leading to an error in the cognitive-emotional interactions. This mismatch can be corrected by activating a nonspecific arousal response, which serves as an error-correcting event.", "timing paradox": "Timing paradox is a phenomenon in which inhibition of orienting responses is spread throughout a time interval, while adaptively timed responses are triggered at the end of the interval. This phenomenon is solved by the Weber law, which creates an adaptively timed response throughout the time interval that peaks at the end of the interval.", "Theory of Mind": "Theory of Mind is a cognitive capacity that enables an individual to understand the mental states of other people, such as their beliefs, desires, and intentions. It is a key component of social cognition and is essential for successful social interaction. In the book, Theory of Mind is used to explain the breakdowns in mental disorders such as autism and schizophrenia, which are characterized by deficits in social functioning. The book suggests that these deficits are caused by hypoactivity of the amygdala or orbitofrontal cortex, which prevents cognitive-emotional resonance from occurring and leads to failures in Theory of Mind processes.", "target swapping paradigm": "The target swapping paradigm is a research method used to investigate how the brain processes visual information by presenting two objects in quick succession and swapping their positions. This procedure prevents the brain from associating the two objects with a single invariant category, thereby testing the brain's ability to distinguish between different objects. In some cases, the target swapping paradigm is combined with an attention shift paradigm to further investigate how spatial attention may affect learning of invariant object categories.", "tripartite texture": "Tripartite texture is a visual pattern consisting of black squares on a white background that are grouped into three distinct regions by the brain, forming horizontal and diagonal boundaries between them. The boundaries are invisible and emerge from the Gestalt rules of visual perception. (This usage of the term may diverge from its conventional meaning, which is a texture composed of three distinct elements.)", "trompe l’oeil": "Trompe l'oeil is a painting technique that creates an optical illusion of three-dimensional depth on a two-dimensional surface. It is used to make a painting look realistic and to create the illusion of a three-dimensional space. In this book, trompe l'oeil is used to describe the visual effects created by the painterly technique of chiaroscuro, whereby light and dark paints are organized in gradients that cause a percept of a bulging 3D figure instead of the actual 2D painted surface.", "typography portraits": "Typography portraits are a type of artwork that uses typography (the arrangement of typefaces, font sizes, and other design elements) to create a portrait of a person. In this book, the term is used to refer to specific examples of this type of artwork, such as Sean Williams' portrait.", "Vector Associative Map": "Vector Associative Map (VAM) is a model of neural networks developed by Gaudiano and Grossberg (1991, 1992) that uses mismatch learning to calibrate inputs from a target position vector (T) and a present position vector (P) in order to control arm movement trajectories and tool use. VAM is an elaboration of the Vector Integration to Endpoint (VITE) model.", "mismatch learning": "Mismatch learning is a form of error-driven learning that uses discrepancies between expected and actual results as teaching signals to adaptively adjust the parameters of a system. In the context of the book, mismatch learning is used to calibrate the inputs from a target position vector and a present position vector via mismatch learning of adaptive weights at the difference vector.", "Gierer-Meinhardt reaction-diffusion": "The Gierer-Meinhardt reaction-diffusion model is a mathematical model of development which describes the self-organizing pattern transformations within cells. It is based on reaction-diffusion equations which describe the interactions between two or more chemical substances in a given environment. This model has been used to explain phenomena such as the directed growth of connections and learned tuning, the gastrula initiation process, and the regeneration of Hydra's heads. \n\nThe usage of the term in this book does not diverge from its conventional meaning.", "visual persistence": "Visual persistence is the phenomenon in which a visual image or percept remains visible for a period of time after the stimulus that created it has been removed. This phenomenon is typically measured in terms of the amount of time it takes for the image or percept to disappear. Visual persistence is often used to explain data about perceptual grouping, motion perception, and other visual phenomena.", "word superiority effect": "The word superiority effect is a phenomenon in which individuals are better able to recognize and recall words than non-words or letter strings. This effect is thought to be due to the fact that words are more deeply encoded in memory than non-words. The usage in this book diverges from the conventional meaning in that it is used to explain the Magical Number Seven, the word length effect, and other cognitive data.", "ARTPHONE": "ARTPHONE is an artificial neural network model developed to explain how speech and language learning, perception, recognition, and recall occur. It is based on the Adaptive Resonance Theory (ART) design principles and mechanisms, which are variations of the same underlying canonical circuit design. ARTPHONE utilizes rate-dependent gain control to create rate-invariant working memory representations in response to sequences of variable-rate speech. It can explain and quantitatively simulate psychophysical data that would otherwise seem to be quite mysterious.", "cooperation and competition": "Cooperation and competition is a concept used to describe the balance between two processes in order to achieve a desired outcome. Cooperation is the act of working together towards a common goal, while competition is the act of striving to be better than others. In the context of this book, cooperation and competition are used to describe the balance between two processes in order to solve the noise-saturation dilemma in cellular networks. This balance is necessary for the process to work well, as an imbalance can lead to maladaptive outcomes.", "brightness assimilation": "Brightness assimilation is a visual phenomenon in which the luminance differences between adjacent regions are decreased, rather than increased. This is caused by the process of discounting the illuminant, which can lead to a variety of illusory percepts.", "CLEARS": "CLEARS is an acronym for Consciousness, Learning, Expectation, Attention, Resonance, and Synchrony, which are processes that are believed to be essential for the functioning of the brain. These processes are related to one another in specific ways, and are thought to be necessary for the brain to solve the stability-plasticity dilemma.", "DIRECT model": "The DIRECT model is a neural network model developed by Bullock, Grossberg, and Guenther (1993) which is used to explain motor-equivalent reaching and tool use. It uses a circular reaction that is energized by an Endogenous Random Generator (ERG) to learn a spatial representation of a target in space. It can accurately move an arm for the first time when its joints are clamped, and can manipulate a tool in space. It is also used to explain motor-equivalent speech production using circuits homologous to DIRECT reaching circuits.", "DOG": "Difference Of Gaussians (DOG) is a mathematical equation used to calculate the contrast of inputs to each position in a multiple scale network. It is defined by a weighted difference of the on-center and off-surround kernels, and is used to detect contours in a multiple scale network. The equation is normalized by a Sum Of Gaussians (SOG), which suppresses informational noise.", "FACADE theory": "FACADE theory is a vision theory that proposes that individual brain cells code visible representations by combining properties of Form- And- Color- And- DEpth (FACADE). This theory predicts that such multiplexed FACADE representations are computed via computationally complementary cortical streams and completed in prestriate visual area V4. FACADE theory is used to explain figure- ground perception, 3D vision, and the control of eye movement target positions.", "illusory contours": "Illusory contours are visual boundaries that appear to be present in a scene, even though they are not actually physically present. They are formed by the grouping of elements in the scene, such as line segments, that are arranged in a particular way. This arrangement induces a perception of a boundary, even though there is no physical boundary present. In this book, the term is used to refer to boundaries that are formed by the grouping of elements in a scene, and the persistence of these boundaries over time.", "invariant learning": "Invariant learning is a type of learning that involves grouping together situational variations in order to recognize objects, persons, or events. This type of learning helps to reduce the amount of information that needs to be stored in the brain, and helps to ensure speaker-independent imitation and understanding, as well as rate-invariant learning and understanding. It is also used to help control learning of expectations about outcomes which may be accidental, but may not be disconfirmed if we are powerless to control them.", "laminar cortical": "Laminar cortical designs are a type of neural circuitry which are composed of several layers of neurons and are used to model different kinds of intelligence such as vision, speech, and cognition. These designs are used in the computational paradigm of Laminar Computing which attempts to show how different parts of the neocortex can represent and control very different kinds of behavior.", "Item-Order-Rank": "Item-Order-Rank (IOR) is a type of working memory that stores and processes information in terms of items, their order, and their rank. It is typically used to refer to the ability to remember and recall a sequence of items in the correct order and with the correct ranking. This type of working memory is important for tasks such as language processing, recognition of speech and language, and the storage and recall of lists. In some contexts, Item-Order-Rank may also refer to the ability to store and recall information in terms of item categories and item-list resonances.", "Koch": "Christof Koch is a neuroscientist and philosopher who, along with Francis Crick, proposed a theory of consciousness in 1990. Koch and his colleagues have since studied the neural correlates of consciousness and developed a theory of how attention and consciousness are linked, known as the Attentional Resonance Theory (ART).", "LIGHTSHAFT": "LIGHTSHAFT is a computational model developed by Grossberg, Kuhlmann, and Mingolla in 2007 that quantitatively simulates psychophysical data about depth-from-texture percepts. It is based on the idea of multiple filter scales voting for multiple depth-restricted groupings.", "TELOS model": "The TELOS model is a comprehensive neural architecture developed by Stephen Grossberg and his collaborators that explains and simulates how sequences of eye movements can be stored, learned, planned, and performed. It incorporates properties from the LIST PARSE model of working memory and the TELOS model of balancing reactive and planned movements. The lisTELOS model unifies and further develops concepts and mechanisms from both of these sources.", "ARTSCENE model": "The ARTSCENE model is a computational model developed by Grossberg and Huang (2009) to classify natural scenes into texture categories. It uses supervised learning with the ARTMAP circuitry to learn the gist of the scene and refine the scene identity by assuming that the eyes randomly look across the scene. It is used to study visual search and the processes that regulate working memory.", "STM": "STM (short-term memory) is a type of memory that is used to store information for a short period of time, usually for a few seconds or minutes. It is a type of memory that is used for immediate processing and recall of information. STM is typically used to store information that is needed for a specific task or activity, such as a phone number or a name. STM is distinct from LTM (long-term memory) which is used to store information for a longer period of time.", "START model": "The START model is a cognitive-emotional model of adaptively timed learning that explains how the hippocampus and cerebellum interact to bridge the temporal gap between a predictive cue and its valued consequence. The model includes a spectral timing circuit that uses a population of cells with differently timed responses to inhibit spurious orienting responses throughout its adaptively timed interval, and to maintain motivated attention upon learned response with maximal probability at the expected time of occurrence of the reward. The model has been extended to the nSTART model, which explains the link between conditioning and consciousness by embedding the CogEM model into a larger learning circuit that includes the hippocampus.", "SyNAPSE": "SyNAPSE (Systems of Neuromorphic Adaptive Plastic Scalable Electronics) is a DARPA program that seeks to understand how laminar neocortical circuits control various forms of intelligence such as vision, speech, and cognition. It uses a computational paradigm called Laminar Computing to model these circuits and explain how variations in the canonical laminar circuit design can lead to different psychological properties.", "SPEM": "Smooth Pursuit Eye Movement (SPEM) is a type of eye movement in which the eyes move in a smooth, continuous motion to track a moving object. It is distinct from a saccadic eye movement (SAC), which is a ballistic, jerky motion used to quickly jump from one fixation point to another. SPEMs are used to keep the fovea fixed on an object as it moves relative to the observer, and they can be used to track targets with speeds up to 30° per second. SPEMs are coordinated by interactions between multiple brain regions, and they can be maintained even when the target is no longer visible on the retina.", "Alzheimer’s disease": "Alzheimer’s disease is a progressive, degenerative neurological disorder characterized by the gradual loss of memory, cognitive abilities, and physical functioning. It is the most common cause of dementia and is incurable. Symptoms include confusion, disorientation, difficulty with language, mood swings, and changes in behavior.", "Ziziphus jujuba": "Ziziphus jujuba (ZJ) is a plant species native to Asia and the Mediterranean region. It is known for its medicinal properties and has been used to activate the enzyme choline acetyltransferase (ChAT), which is responsible for the synthesis of the neurotransmitter acetylcholine (ACh). In the book, the authors suggest that ZJ extract may have repairing effects on memory and behavioral disorders.", "Wyse": "Wyse is a term used to refer to Lonce Wyse, a colleague of Stephen Grossberg, Michael Cohen, and Krishna Govindarajan who worked on the ARTSTREAM model. ARTSTREAM is a neural network model of auditory scene analysis and source segregation, which explains how the brain may stably learn categories that represent the pitch of a sound.", "LTM Invariance Principle": "The LTM Invariance Principle is a postulate proposed by Grossberg in 1978 that states that working memories are designed to enable stable list chunking to occur. This principle guarantees that when a novel word is stored in working memory, it does not force the forgetting of previously learned list chunks that code for its familiar subwords. This principle is achieved by preserving the relative activities, or ratios, between previously stored working memory activities as new list items are stored in the working memory.", "Magical Number": "The Magical Number is a term used to describe the phenomenon of humans being able to recall a limited number of items in a particular order. The Magical Number Seven Plus or Minus Two is the immediate memory span (IMS) of 7+/-2 items that was described in 1956 in a seminal article by George Miller (Miller, 1956). This fact asserts that 7+/-2 chunks can typically be recalled in the correct order during free recall experiments. The Magical Number Four Plus or Minus One is the transient memory span (TMS) of 4+/-1 items that was described in 1978 in an article by Stephen Grossberg (Grossberg, 1978a). This fact asserts that 4+/-1 chunks can typically be recalled in the correct order during free recall experiments.", "Masking Field chunks": "Masking Field chunks are a type of chunking process used to store temporal order information. This process involves the use of a masking field to store the chunks in a specific order. \n\nDifferences from conventional meaning: Masking Field chunks are typically used to store temporal order information, which is different from the conventional meaning of chunking, which is usually used to store information in a more general sense.", "Weber law": "Weber law is a principle that states that the sensitivity of a system to a stimulus is inversely proportional to the intensity of the stimulus. In other words, the greater the intensity of the stimulus, the less sensitive the system is to it. In the context of the book, Weber law is used to describe the adaptation of cells in the brain to varying inputs, such as light intensity. This adaptation is achieved by dividing the current input by a time average of previous inputs, thereby normalizing the response via an intracellular Weber law.", "VITE model": "The Vector Integration to Endpoint (VITE) model is a circuit-based model developed by Stephen Grossberg and Daniel Bullock in 1988 to explain how arm movement trajectories are controlled by the brain. The model uses three vectors (T, P, and D) to explain how motor synergy, synchrony, and speed are achieved. It also explains how the volitional GO signal G multiplies the difference vector D to form the product DG[]+ to control arm movement trajectories. The VITE model has been used to explain a variety of arm movement properties, such as velocity profile asymmetry, isotonic arm movement properties before and after de-afferentation, Fitt’s law, and the 2/3 Power Law of Lacquiniti.", "endpoint": "An endpoint is a point at which a line or other object terminates. In the context of this book, endpoints refer to the positions of the line endpoints that remain unchanged when the orientation of the lines is changed.", "VITE": "Vector Integration to Endpoint (VITE) is a model of arm trajectory formation that enables the three S’s of a movement to be realized: Synergy formation, Synchrony of muscles within a synergy, and variable Speed that is under volitional control. The VITE model uses the T, P, and D vectors to explain how the Three S’s of reaching— Synergy, Synchrony, and Speed— are carried out. The GO signal G multiplies the difference vector D to form the product DG[]+ which is integrated by P, changing G changes the rate at which P approaches T, and thus the velocity of movement. The model is able to explain how a simple reaching movement by an arm can be carried out in an approximately straight movement trajectory through space.", "Principle of Sufficient Reason": "The Principle of Sufficient Reason is a philosophical concept which states that for any event or action, there must be a sufficient cause or reason for it to occur. In the context of the book, the Principle of Sufficient Reason is used to explain how a coding error can be corrected without any individual cell knowing that an error has occurred. It is proposed that a mismatch between two layers of the attentional system triggers a burst of nonspecific arousal that activates all cells in the system equally, thus influencing all potential sources of the error.", "Principle of Conservation of Energy": "The Principle of Conservation of Energy is a fundamental law of physics that states that energy cannot be created or destroyed, but can only be transferred or transformed from one form to another. In the context of this book, it is used to describe the contributions of Hermann von Helmholtz to the understanding of visual perception and music, as his work in physical acoustics supported his major contributions to understanding auditory perception and music.", "reconsolidation": "Reconsolidation is the process of updating or altering existing memories in the brain. It involves the synthesis of new proteins in neurons, and can be triggered by the presentation of new information during a labile window of time. It can be used to combat mental disorders such as PTSD by replacing fearful memories with non-fearful memories.", "READ": "READ stands for REcurrent Associative Dipole, which is a type of recurrent shunting on-center off-surround network with habituative transmitter gates. It is used to enable secondary inhibitory conditioning, maintain a stable motivational baseline, and allow for rapid motivational switching.", "SOM theta": "SOM Theta is a type of rhythm used to dissociate read-out from read-in in a Self-Organizing Map (SOM) model. It is achieved by using back-propagating teaching signals and two competing SOM category cells that each receive multiple inputs via their dendritic trees. This rhythm is used to solve the noise-saturation dilemma and to maintain the plasticity of synapses that learn cognitive-emotional associations from object categories to value categories.", "residual traces": "Residual traces are the afterimages or ghostly forms that remain after an image has been removed or shut off. They are often seen as orientational afterimages, such as the MacKay illusion, which is a circular form that appears perpendicular to the radial lines of an image after it has been removed. Residual traces are used in perceptual studies to measure how long it takes for a percept to disappear after the image has been removed.", "SACCART": "SACCART (Superior Colliculus Category-Learning and Attentional Regulation Theory) is a model developed by Grossberg et al. (1997) which proposes how the superior colliculus (SC) movement map is learned as part of a motor category learning process, and how this learning is dynamically stabilized by a top-down attentional feedback circuit that obeys the ART Matching Rule. The model is supported by neurophysiological and anatomical data about cell types in the SC, and has been used to explain data from the optic tectum of the pigeon.", "MAVIN": "MAVIN (Mobile Adaptive Visual Navigator) is a pioneering adaptive mobile robot developed in 1991 by Aijaz Baloch and Allen Waxman. It includes a neural system that integrates processes from visual object learning and recognition to behavioral conditioning. MAVIN is used to demonstrate classical conditioning properties in an end-to-end simulation on the robot that includes registration of sensory events.", "shock avoidance": "Shock avoidance is a type of learning in which an individual learns to avoid a situation or stimulus that causes fear or anxiety, typically through the relief of escaping the situation or stimulus. This type of avoidance behavior can persist for a long time without having to re-experience the fearful situations that they were learned to avoid.", "shunting": "Shunting is a type of network used in neurophysiology to describe the behavior of cells in response to input signals. It is a type of on-center off-surround network, where the cells interact with each other via excitatory and inhibitory signals. This type of network is used to solve the noise-saturation dilemma, where the cells are able to process distributed patterns of inputs without experiencing either noise or saturation.", "Shunting Model": "Shunting Model is a type of nonlinear differential equation used to describe neural networks. It is based on the membrane equations of neurophysiology and keeps cell activities within fixed upper and lower bounds using automatic gain control terms. It is used to explain and predict psychological and neurobiological data.", "shunting laws": "Shunting laws are mathematical equations that describe how neurons interact with each other in a network. They are also known as the membrane equations of neurophysiology. These laws are used to explain how on-center off-surround networks, which are found ubiquitously in the brain, can solve the noise-saturation dilemma.", "silent inhibition": "Silent inhibition is a property of a neural network that states that the inhibitory saturation voltage V- and the passive saturation voltage Vp are the same. This means that no matter how strong the off-surround inhibition may become, the activity or potential of a cell can only be driven towards the equilibrium potential defined by the passive saturation voltage, but not below it.", "receptive field": "A receptive field is a region of the visual field to which a neuron responds. It is the area of space in which a stimulus will cause a neuron to fire an action potential. Receptive fields can vary in size and shape and can be either excitatory or inhibitory. In the context of this book, receptive fields are used to explain how boundaries and surfaces form and how they contribute to depth perception.", "SOVEREIGN": "Sovereign is an adjective that refers to having supreme power or authority, especially in a political context. In this book, the term Sovereign is used to refer to a model that explains how the brain balances reactive and planned behaviors during spatial navigation. The model explains how erratic reactive exploratory behaviors lead to learning of the most efficient routes whereby to acquire a valued goal, without losing the ability to balance reactive and planned behaviors so that planned behaviors can be carried out where appropriate, without losing the ability to respond quickly to novel reactive challenges.", "homologous circuits": "Homologous circuits are circuits that have similar structures and functions, often used to learn and control motor-equivalent reaching and speaking. In the context of the book, homologous circuits are used to store sequences of experienced objects and sequences of experienced movements in working memory, and to unitize them in object and movement list chunks, respectively. These list chunks can then be motivationally amplified or suppressed via reinforcement learning.", "spatial impenetrability": "Spatial impenetrability is the property of objects in a scene that prevents them from penetrating each other. This property is used to explain why certain boundary groupings do not form in a scene, such as when the boundaries of an object occlude the boundaries of other objects in a scene. Spatial impenetrability is also used to explain why T-junctions can successfully trigger figure-ground separation, and why certain objects appear to lie in front of other objects.", "figure-ground": "Figure-ground is a term used to describe the process of perceiving an object as distinct from its background. It is a Gestalt principle that states that when looking at a complex visual scene, the eye will separate the object from its background and perceive it as a distinct figure. In this book, figure-ground is used to describe the process of separating an object from its background in order to perceive it in 3D.", "SOS": "Spatial Object Search (SOS) is a neural model that explains and simulates visual search data by interactions between boundary, surface, spatial, and object representations. It is used to explain phenomena such as visual neglect, crowding, and visual search. The usage of the term in this book does not diverge from its conventional meaning.", "dARTSCAN": "dARTSCAN is a distributed version of the ARTSCAN model, which is a computer simulation of figure-ground separation used to explain crowding data. It includes spatial attention in both the posterior parietal cortex and prefrontal cortex, and both fast-acting attention triggered by transient cells in cortical areas such as MT, and slower-acting surface-shroud resonances in What cortical areas such as V4 and PPC."}