{"ART": "Adaptive Resonance Theory (ART) is a cognitive and neural theory developed by Stephen Grossberg in 1976 that explains how our brains learn to attend, recognize, and predict objects and events in a changing world. It is based on the concept of adaptive resonance, which is a consensus between what is out there in the world and what we expect to see based on our past experiences. ART is used in two forms: as algorithms for large-scale engineering and technological applications, and as a biological theory. It has been used in many applications, including engineering design retrieval systems, classification and prediction of sonar and radar signals, and control of mobile robots.", "shroud": "A shroud is a piece of cloth or other material used to cover or wrap something, especially a corpse, for burial.", "anticipatory": "Anticipatory error gradient is a term used to describe the errors made when recalling items from a list, where errors are more likely for items closer to the beginning of the list than those further away.", "Hebbian": "Hebbian learning is a type of learning in which an increase in the strength of a connection between two neurons is associated with an increase in the activity of both neurons. It is based on the idea that neurons that fire together, wire together, and is named after the Canadian psychologist Donald Hebb.", "associative": "Associative is a type of learning in which an association is made between two stimuli, such that the presence of one stimulus leads to the anticipation of the other. It is a form of classical conditioning in which a previously neutral stimulus becomes associated with a response.", "attentive": "Attentive means paying close attention to something or someone. It is the act of focusing one's mental or physical energy on a particular task or activity.", "babbling": "Babbling is a phase of development in which babies spontaneously generate sounds and movements to explore their environment. It is during this phase that babies learn a map between their motor commands and the corresponding auditory and visual representations.", "complementary": "Complementary Computing is a form of computation in which multiple processing streams interact together to overcome the complementary weaknesses of individual processing stages. It is a revolutionary paradigm for explaining how brains give rise to minds.", "bistable": "Bistable is a phenomenon in which a single stimulus can be perceived in two different ways, and the perception can switch spontaneously between the two interpretations.", "filling-in": "Filling-in is a perceptual process in which incomplete or missing visual information is completed or filled in by the brain. It is a process that occurs when the brain takes incomplete visual information and uses what it already knows to fill in the gaps.", "cARTWORD": "cARTWORD is a laminar cortical model of speech perception, learning, and recognition that uses variations of the same canonical laminar circuitry to explain and predict data about speech perception. The model is based on the Adaptive Resonance Theory (ART) and uses two- way interactions between bottom- up and top- down processing to explain how conscious speech perception occurs.", "polyvalent": "Polyvalent is an adjective meaning having multiple uses or functions.", "outstar": "Outstar learning is a type of learning algorithm used to learn top-down expectations in artificial neural networks. It involves a single category node sending multiple diverging pathways to a network of feature nodes. The adaptive weights in the outstar pathways learn the average pattern of activity across the feature level nodes throughout the time interval when the sampling signal fxii() is positive. Outstar learning is often used in combination with instar learning to learn the adaptive weights in bottom-up filters and top-down expectations in an ART network.", "consciousness": "Consciousness is the state of being aware of one's environment and one's own thoughts, feelings, and sensations. It is the ability to experience and process information from the external world and the internal world of the mind.", "qualia": "Qualia is the subjective experience of sensory phenomena, such as the feeling of pain or the taste of a strawberry, that cannot be explained in terms of physical properties. It is a term used in philosophy to describe the subjective, conscious experience of an individual.", "vision": "Vision is the ability to perceive or detect visual information using the eyes. It involves the ability to process and interpret visual information, and to recognize patterns and objects in the environment.", "paradigm": "A paradigm is a set of assumptions, concepts, values, and practices that constitutes a way of viewing reality for the community that shares them, especially in an intellectual discipline.", "amodal": "Amodal perception is the ability to recognize an object or boundary without any corresponding visible surface qualia. It is a type of perception that is based on the interaction of boundaries and surfaces, rather than on visible signs of brightness, color, or other qualia.", "contrast-invariant": "Contrast-invariant boundary perception is a phenomenon in which the boundaries of an object remain recognizable despite changes in contrast or illumination."}